Revit 2026 API

# AssemblyViewUtils Class

---

Utilities that provide capabilities related to assembly view creation and validation.

SystemObject Autodesk.Revit.DBAssemblyViewUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class AssemblyViewUtils
```
```vb
Public NotInheritable Class AssemblyViewUtils
```
```cpp
public ref class AssemblyViewUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AssemblyViewUtils = class end
```

The AssemblyViewUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AcquireAssemblyViews | Transfers the assembly views owned by a source assembly instance to a target sibling assembly instance of the same assembly type. |
|  | Create3DOrthographic(Document, ElementId) | Creates a new orthographic 3D assembly view for the assembly instance. |
|  | Create3DOrthographic(Document, ElementId, ElementId, Boolean) | Creates a new orthographic 3D assembly view for the assembly instance. The view will have the same orientation as the Default 3D view. The document must be regenerated before using the 3D view. |
|  | CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation) | Creates a new detail section assembly view for the assembly instance. |
|  | CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation, ElementId, Boolean) | Creates a new detail section assembly view for the assembly instance. |
|  | CreateMaterialTakeoff(Document, ElementId) | Creates a new material takeoff multicategory schedule assembly view for the assembly instance. |
|  | CreateMaterialTakeoff(Document, ElementId, ElementId, Boolean) | Creates a new material takeoff multicategory schedule assembly view for the assembly instance. |
|  | CreatePartList(Document, ElementId) | Creates a new part list multicategory schedule assembly view for the assembly instance. |
|  | CreatePartList(Document, ElementId, ElementId, Boolean) | Creates a new part list multicategory schedule assembly view for the assembly instance. |
|  | CreateSheet | Creates a new sheet assembly view for the assembly instance. |
|  | CreateSingleCategorySchedule(Document, ElementId, ElementId) | Creates a new single-category schedule assembly view for the assembly instance. |
|  | CreateSingleCategorySchedule(Document, ElementId, ElementId, ElementId, Boolean) | Creates a new single-category schedule assembly view for the assembly instance. |

#### Reference

Autodesk.Revit.DB Namespace